README.org
#+HTML_HEAD:   <link rel="stylesheet" type="text/css" href="//dotfiles-abcdefg.gitlab.io/css/org.css"/>

#+NAME: bindings-from-table
#+BEGIN_SRC emacs-lisp :noweb yes :exports none :results silent pp :tangle no :var table=()
  (let ((current-group-name "global"))
    (mapcan '(lambda (binding)
               (let ((group-name (nth 0 binding))
                     (binding (nth 1 binding))
                     (fun (nth 2 binding)))
                 (if (equal current-group-name group-name)
                     `((,binding . ,(intern fun)))
                   (progn
                     (setq current-group-name group-name)
                     `(:map ,(intern group-name) (,binding . ,(intern fun)))))))
            table))
#+END_SRC

#+NAME: bind-keys-from-table
#+BEGIN_SRC emacs-lisp :noweb yes :exports none :results silent pp :tangle no :var table=()
  (append '(setq) (mapcan (lambda (row)
                            (let ((variable (nth 0 row))
                                  (text (nth 1 row))
                                  (symbol (nth 2 row)))
                              `(,(intern variable) (quote ,(cons text symbol)))))
                          table))
#+END_SRC


#+TITLE:       Emacs
#+AUTHOR:      Howard Logsdon
#+EMAIL:       (concat "howard" at-sign "hplogsdon.com")
#+DESCRIPTION: Emacs configuration
#+LANGUAGE:    en
#+OPTIONS:     toc:2

* Emacs


This document describes and documents my Emacs configuration. It has been
cobbled together from many other sources.

Documentation and other information:
- [[https://www.masteringemacs.org/article/whats-new-in-emacs-301][Whats New In Emacs 30.1]]
- [[https://www.emacswiki.org/emacs/InitFile][Emacs Init File Wiki]]
- [[https://suvratapte.com/configuring-emacs-from-scratch-packages/][Emacs From Scratch]]
- [[https://emacswiki.org/][Emacs Wiki]]

Using Org Mode:
- [[http://doc.norang.ca/org-mode.html][Org Mode -- Organize Your Life In Plain Text!]]
- [[https://www.emacswiki.org/emacs/OrgJournal][Org Journal Wikipage]]
- [[https://orgmode.org/worg/orgcard.html][OrgMode Card]]
- [[https://github.com/yugaego/cheat-sheets/blob/6da1e3e22708ae635a5fe8a33305af7b829d77aa/Org-Mode.org][OrgMode Cheatsheet]]
- [[https://ogbe.net/blog/emacs_org_static_site][OrgMode Static Website]]

Using various modes and plugins:
- [[https://arjenwiersma.nl/notes/clojure-emacs/][Clojure in Emacs]]
- [[https://arjanvandergaag.nl/blog/using-yasnippet-in-emacs.html][YASnippet]]

`use-package' Documentation:
- [[https://github.com/jwiegley/use-package/blob/master/README.md][Original use-package README]]
- [[https://jwiegley.github.io/use-package/keywords][use-package keywords]]
- [[https://ianyepan.github.io/posts/setting-up-use-package/][Setting up use-package]]
- [[https://emacswiki.org/emacs/UsePackage][use-package Wikipage]]


Some other configurations I found useful:
- [[https://github.com/MiniApollo/kickstart.emacs/blob/6f41da743b3fca81e30da049f3e966aab81c865b/init.org][MiniApollo]]
  A not-huge config that covers a lot of modern use cases

- [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs Config]]
  This is a web page created from the output of their emacs config. A neat idea.

- [[https://github.com/leoc/.emacs.d/blob/5ee2d1a/init.el][leoc/.emacs.d]]
  A bit older, but was an initial starting point when I was restructuring my emacs config with tangled-org-mode. Has a lot of filetype mode configurations.
  - took their =diff-hl= config
  - they also have a great =orgmode= config
  - I took the keyinding `bindings-from-table' methods from them.

- [[https://github.com/purcell/emacs.d][purcell/emacs.d]]
  I took the use of subfiles/submodules very literally from this repo, however I might undo this, as the "literate" style here seems a bit less confusing. Unfortunately, this repo doesn't use =use-package= though, so while many things are borrowed, most isn't an exact replica.

- [[https://github.com/daviwil/emacs-from-scratch][emacs-from-scratch]]
  The structure of this project is well designed. =orgmore= was great, but most programming is very generic (as expected).

- [[https://github.com/mwfogleman/.emacs.d/blob/642819a/tasshin.org][Tasshin Fogelman's configuration]]
  Clojure config was great, as well as =Magit=, =projectile=, and =orgmode=

- [[https://github.com/SeanMooney/emacs/blob/d3e4d90/lit.org][SeanMooney/emacs]]
  Has some GPT/AI configuration I found useful



* Organization

We're borrowing heavily from [[https://github.com/purcell/emacs.d][purcell/emacs.d]], which breaks a giant `init.el' into smaller module files, which are then require'd in specific orders. We're messing up that style though by simply declaring a bunch of `(use-package ...)' calls instead of finding conditional requirements for different modes to fix the performance issues. This, admittedly, makes doing the module includes somewhat redundant. I still like it, so I'm keeping it. Besides, it makes documenting what I'm doing easier.

TODO: Add more references to the init files that I've +stolen+ borrowed from


* Early Init

This bootstraps a number of things that should be set before we start installing packages and loading other files

#+BEGIN_SRC emacs-lisp :tangle early-init.el :mkdirp yes :comments no
  ;;; early-init.el --- Emacs 27+ pre-init config -*- lexical-binding: t -*-

  ;;; Documentation: (info "(emacs) Early Init File")
  ;;;                (info "(emacs) Package Installation")
  ;;; Commentary:

  ;; Emacs 27+ loads this file before (normally) calling
  ;; `package-initialize'. We use this file to suppress that automatic
  ;; behavior so that startup is consistent across Emacs versions.
  ;;
  ;; We set 'package-enable-at-startup' to 'nil' so that Emacs will not
  ;; automatically activate all installed packages before init.el (but
  ;; after reading this early-init.el)

  ;;; Code:
  (setq package-enable-at-startup nil)

  (setq tool-bar-mode nil
        menu-bar-mode t)

  (setq initial-frame-alist
        '((width . 90)
          (height . 55)))

  ;; The scratch buffer is created before `user-unit-file` is evaluated, so if
  ;; you want `find-file` to start somewhere other than ~ it needs to be here in
  ;; your early-init file.
  (defvar user-home-dir "~/src/")
  (setq default-directory user-home-dir)

  ;; end early-init.el
#+END_SRC


* Init Setup

** Lisp Dir

The following creates a lisp dir and then tells emacs to not byte-compile anything it. Admittedly, we can compile these if we're source-of-truthing them here.

#+BEGIN_SRC emacs-lisp :tangle lisp/.dir-locals.el :mkdirp yes :comments no
  ;;; Directory Local Variables
  ;;; For more information see (info "(emacs) Directory Variables")

  ((emacs-lisp-mode
    (no-byte-compile . t)))

#+END_SRC

** Site Lisp Dir

Site Lisp is similar, but is reserved for "vendored" modules or packages. Here we just create the file but don't specify anything. I want emacs to complain on startup if this directory doesnt exist.

#+BEGIN_SRC emacs-lisp :tangle site-lisp/.dir-locals.el :mkdirp yes :comments no
  ;;; Directory Local Variables
  ;;; For more information see (info "(emacs) Directory Variables")

#+END_SRC

* Configuration

The main configuration.

** Header and Guard Statements

Declare what the file is and what its for.

#+BEGIN_SRC emacs-lisp :tangle init.el :mkdirp yes :comments no
  ;;; init.el --- Local Initialization File -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;;   This config targets Emacs 30, and is automatically generated via
  ;;;   Org-Mode Tangled file README.org
  ;;;
  ;;;   Written by hplogsdon (https://gitlab.com/hplogdon/dotfiles)
  ;;;
  ;;;   Do not edit this by hand.
  ;;;
  ;;; Code:

#+END_SRC

Then ensure we're running an appropriate version of Emacs, or bail out early.

#+BEGIN_SRC emacs-lisp :tangle init.el :mkdirp yes :comments link
  ;; Produce backtraces on error: helpful for startup issues
  (setq debug-on-error t
        debug-on-quit nil
        debug-on-signal nil)

  (let ((minver "29.1"))
    (when (version< emacs-version minver)
      (error "Emacs is too old.")))

  ;; Add the `lisp' directory
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+END_SRC


** Initialization
*** Early Configuration

**** Benchmarking

This measures startup and require times. Should be included as early as possible

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Measure startup time and require times

  (defun sanityinc/time-subtract-millis (b a)
    "Subtract time A from time B in milliseconds."
    (* 1000.0 (float-time (time-subtract b a))))


  (defvar sanityinc/require-times nil
    "A list of (FEATURE LOAD-START-TIME LOAD-DURATION).
  LOAD-DURATION is the time taken in milliseconds to load FEATURE.")


  (defun sanityinc/require-times-wrapper (orig feature &rest args)
    "Note in `sanityinc/require-times' the time taken to require each feature."
    (let* ((already-loaded (memq feature features))
  	 (require-start-time (and (not already-loaded) (current-time))))
      (prog1
  	(apply orig feature args)
        (when (and (not already-loaded) (memq feature features))
  	(let ((time (sanityinc/time-subtract-millis (current-time) require-start-time)))
  	  (add-to-list 'sanityinc/require-times
  		       (list feature require-start-time time)
  		       t))))))


  (advice-add 'require :around 'sanityinc/require-times-wrapper)

  (define-derived-mode sanityinc/require-times-mode tabulated-list-mode "Require-Times"
    "Show times taken to `require' package"
    (setq tabulated-list-format
  	[("Start time (ms)" 20 sanityinc/require-times-sort-by-start-time-pred)
  	 ("Feature" 30)
  	 ("Time (ms)" 12 sanityinc/require-times-sort-by-load-time-pred)])
    (setq tabulated-list-sort-key (cons "Start time (ms)" nil))
    (setq tabulated-list-padding 2)
    (setq tabulated-list-entries #'sanityinc/require-times-tabulated-list-entries)
    (tabulated-list-init-header)
    (when (fboundp 'tablist-minor-mode)
      (tablist-minor-mode)))


  (defun sanityinc/require-times-sort-by-start-time-pred (entry1 entry2)
    "Sorting function predicate for `sanityinc/require-times-mode' comparing ENTRY1 and ENTRY2 by start time."
    (< (string-to-number (elt (nth 1 entry1) 0))
       (string-to-number (elt (nth 1 entry2) 0))))


  (defun sanityinc/require-times-sort-by-load-time-pred (entry1 entry2)
    "Sorting function predicate for `sanityinc/require-times-mode' comparing ENTRY1 and ENTRY2 by load time."
    (> (string-to-number (elt (nth 1 entry1) 0))
       (string-to-number (elt (nth 1 entry2) 0))))


  (defun sanityinc/require-times-tabulated-list-entries ()
    "Show require times of all modules in a table format."
    (cl-loop for (feature start-time millis) in sanityinc/require-times
  	   with order = 0
  	   do (cl-incf order)
  	   collect (list order
  			 (vector
  			  (format "%.3f" (sanityinc/time-subtract-millis start-time before-init-time))
  			  (symbol-name feature)
  			  (format "%.3f" millis)))))


  (defun sanityinc/require-times ()
    "Show a tabular view of how long various libraries took to load."
    (interactive)
    (with-current-buffer (get-buffer-create "*Require Times*")
      (sanityinc/require-times-mode)
      (tabulated-list-revert)
      (display-buffer (current-buffer))))

  (defun sanityinc/show-init-time ()
    "Common function that prints the initialization time of Emacs."
    (message "init completed in %.2fms"
  	   (sanityinc/time-subtract-millis after-init-time before-init-time)))

  (add-hook 'after-init-hook 'sanityinc/show-init-time)

#+END_SRC

