init.el
;;; --- Description statement

;;; init.el --- Local Initialization File -*- lexical-binding: t -*-
;;; Commentary:
;;;   This config targets Emacs 30, and is automatically generated via
;;;   Org-Mode Tangled file README.org
;;;
;;;   Written by hplogsdon (https://gitlab.com/hplogdon/dotfiles)
;;;
;;;   Do not edit this by hand.
;;;
;;; Code:

;; [[file:../Emacs.org::*Header and Guard Statements][Header and Guard Statements:2]]
;; Produce backtraces on error: helpful for startup issues
(setq debug-on-error t
      debug-on-quit nil
      debug-on-signal nil)

(let ((minver "29.1"))
  (when (version< emacs-version minver)
        (error "Emacs is too old.")))

;; Add the `lisp' directory
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
;; Header and Guard Statements:2 ends here

;; [[file:../Emacs.org::*Benchmarking][Benchmarking:1]]
;;; --- Measure startup time and require times

(defun sanityinc/time-subtract-millis (b a)
  (* 1000.0 (float-time (time-subtract b a))))


(defvar sanityinc/require-times nil
  "A list of (FEATURE LOAD-START-TIME LOAD-DURATION).
LOAD-DURATION is the time taken in milliseconds to load FEATURE.")


(defun sanityinc/require-times-wrapper (orig feature &rest args)
  "Note in `sanityinc/require-times' the time taken to require each feature."
  (let* ((already-loaded (memq feature features))
		 (require-start-time (and (not already-loaded) (current-time))))
	(prog1
		(apply orig feature args)
	  (when (and (not already-loaded) (memq feature features))
		(let ((time (sanityinc/time-subtract-millis (current-time) require-start-time)))
		  (add-to-list 'sanityinc/require-times
					   (list feature require-start-time time)
					   t))))))


(advice-add 'require :around 'sanityinc/require-times-wrapper)

(define-derived-mode sanityinc/require-times-mode tabulated-list-mode "Require-Times"
  "Show times taken to `require' package"
  (setq tabulated-list-format
		[("Start time (ms)" 20 sanityinc/require-times-sort-by-start-time-pred)
		 ("Feature" 30)
		 ("Time (ms)" 12 sanityinc/require-times-sort-by-load-time-pred)])
  (setq tabulated-list-sort-key (cons "Start time (ms)" nil))
  (setq tabulated-list-padding 2)
  (setq tabulated-list-entries #'sanityinc/require-times-tabulated-list-entries)
  (tabulated-list-init-header)
  (when (fboundp 'tablist-minor-mode)
	(tablist-minor-mode)))


(defun sanityinc/require-times-sort-by-start-time-pred (entry1 entry2)
  (< (string-to-number (elt (nth 1 entry1) 0))
	 (string-to-number (elt (nth 1 entry2) 0))))


(defun sanityinc/require-times-sort-by-load-time-pred (entry1 entry2)
  (> (string-to-number (elt (nth 1 entry1) 0))
	 (string-to-number (elt (nth 1 entry2) 0))))


(defun sanityinc/require-times-tabulated-list-entries ()
  (cl-loop for (feature start-time millis) in sanityinc/require-times
		   with order = 0
		   do (cl-incf order)
		   collect (list order
						 (vector
						  (format "%.3f" (sanityinc/time-subtract-millis start-time before-init-time))
						  (symbol-name feature)
						  (format "%.3f" millis)))))


(defun sanityinc/require-times ()
  "Show a tabular view of how long various libraries took to load.")


(defun sanityinc/show-init-time ()
  (message "init completed in %.2fms"
		   (sanityinc/time-subtract-millis after-init-time before-init-time)))

(add-hook 'after-init-hook 'sanityinc/show-init-time)
;; Benchmarking:1 ends here
