README.org
**** Defines

A number of helpful defines

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Helpful defines and functions
  (setq *spell-check-support-enabled* nil) ;; Enable with 't if you prefer

  (setq *is-macos* (eq system-type 'darwin))
  (setq *is-windows* (memq system-type '(windows-nt ms-dos cygwin)))
  (setq *is-linux* (eq system-type 'gnu/linux))

  ;; Adjust garbage collection threshold for early startup (see gcmh below)
  (setq gc-cons-threshold (* 128 1024 1024))

  ;; Process performance tuning
  (setq read-process-output-max (* 4 1024 1024))
  (setq process-adaptive-read-buffering nil)

#+END_SRC

**** Bootstrapping

We call this bootstrapping, but we're already a ways into this thing. Here we attempt to load pre-package paths and utilities

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Bootstrap stuff.
  ;; Set user custom file
  (setq custom-file (locate-user-emacs-file "custom.el"))
#+END_SRC

**** Package Management

This is where we bootstrap our package management. This was simply configuring `package.el', but we've moved to using
`straight.el', since Emacs was having issues with the standard ELPA/MELPA packages


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;; Set straight.el default config before bootstrapping
  (setq straight-use-package-by-default t                 ; use-package defaults to straight.el
        straight-recipes-gnu-elpa-use-mirror t            ; use straight's mirror of elpa
        straight-built-in-pseudo-packages                 ; dont auto-fetch these builtins
        '(dired
          emacs-lisp-mode
          inferior-lisp
          isearch
          lsp-mode
          nxml-mode
          use-package
          uniquify
          vc
          which-function-mode))


  ;; The following is probably unused, but I'm not deleting it yet.
  ;;; Standard package repositories
  (setq package-user-dir (expand-file-name (format "elpa-%s.%s" emacs-major-version emacs-minor-version)
                                           user-emacs-directory)
        package-archives '(("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("orgmode"      . "https://orgmode.org/elpa/")
                           ("nongnu"       . "https://elpa.nongnu.org/nongnu/")
                           ("tromey"       . "https://tromey.com/elpa/")
                           ("gnu"          . "https://elpa.gnu.org/packages/")
                           ("melpa"        . "https://melpa.org/packages/"))
        package-archive-priorities '(("melpa-stable" . 30)
                                     ("orgmode"      . 30)
                                     ("nongnu"       . 20)
                                     ("tromey"       . 20)
                                     ("gnu"          .  0)
                                     ("melpa"        .  0)))

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://radian-software.github.io/straight.el/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq use-package-verbose t)
  (straight-use-package 'use-package)

  (require 'cl-lib)

#+END_SRC

***** Package helpers

These are packge-helping packages. The `use-package.el' macro can have several helper keys
added to it, such as =:diminish= or =:delight=. These rely on those packages being loaded
before they'll have any effect, so we load these types of things now.


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Package Helpers

  (use-package diminish
    :ensure t)


#+END_SRC

**** Helper functions and commands

This is where I put random functions that help with random tasks.

***** Init file helpers

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Emacs-Lisp helper functions and commands

  (defun hpl/reload-user-init-file ()
    "Reload the init file."
    (interactive)
    (load-file user-init-file))

  (defun hpl/find-init-file ()
    "Opens emacs.d/init.el in the buffer."
    (interactive)
    (let ((this-init-file "~/.emacs.d/init.el"))
      (find-file this-init-file)))

  (bind-key "C-c C-<f5>" 'hpl/reload-user-init-file)

#+END_SRC

***** Delete files

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;; Delete the current file
  (defun delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (unless (buffer-file-name)
      (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name))
      (kill-this-buffer)))

  ;; Rename the current file
  (if (fboundp 'rename-visited-file)
      (defalias 'rename-this-file-and-buffer 'rename-visited-file)
    (defun rename-this-file-and-buffer (new-name)
      "Renames both current buffer and file it's visiting to NEW-NAME."
      (interactive "New name: ")
      (let ((name (buffer-name))
            (filename (buffer-file-name)))
        (unless filename
          (error "Buffer '%s' is not visiting a file!" name))
        (progn
          (when (file-exists-p filename)
            (rename-file filename new-name 1))
          (set-visited-file-name new-name)
          (rename-buffer new-name)))))

#+END_SRC

***** DWIM Capitalization

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;; Capitalize current word or all words in region
  (defun hpl/capitalization-dwim ()
    "Capitalize all words in region or point."
    (interactive)
    (if (region-active-p)
        (save-excursion (capitalize-region (region-beginning) (region-end)))
      (capitalize-word 1)))

  ;; Upcase current word or region
  (defun hpl/upcase-dwim ()
    "Upcase all words in region or point."
    (interactive)
    (if (region-active-p)
        (save-excursion (upcase-region (region-beginning) (region-end)))
      (upcase-word 1)))

  (defun hpl/downcase-dwim ()
    "Downcase all words in region or point."
    (interactive)
    (if (region-active-p)
        (save-excursion (downcase-region (region-beginning) (region-end)))
      (downcase-word 1)))

  ;; bind keys from table

#+END_SRC

***** Duplication

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (defun hpl/duplicate-current-line-or-region (arg)
    "Duplicate the current line or region ARG times.
  If there is no region, the current line will be duplicated."
    (interactive "p")
    (save-excursion
      (if (region-active-p)
  	(hpl/duplicate-region arg)
        (hpl/duplicate-current-line arg))))

  (defun hpl/duplicate-region (num &optional start end)
    "Duplicates the region bounded by START and END NUM times.
  If not START and END are provided, the current region-beginning and
  region-end are used. Adds the duplicated text to the kill ring."
    (interactive "p")
    (let* ((start (or start (region-beginning)))
  	 (end (or end (region-end)))
  	 (region (buffer-substring start end)))
      (kill-ring-save start end)
      (goto-char start)
      (dotimes (i num)
        (insert region))))

  (defun hpl/duplicate-current-line (num)
    "Duplicates the current line NUM times."
    (interactive "p")
    (when (eq (point-at-eol) (point-max))
      (goto-char (point-max))
      (newline)
      (forward-char -1))
    (hpl/duplicate-region num (point-at-bol) (1+ (point-at-eol))))

  ;; bind keys from table

#+END_SRC

***** New lines

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (defun hpl/open-line-below ()
    "Opens a line below the point."
    (interactive)
    (end-of-line)
    (newline)
    (indent-for-tab-command))

  (defun hpl/open-line-above ()
    "Open a line above the point."
    (interactive)
    (beginning-of-line)
    (newline)
    (forward-line -1)
    (indent-for-tab-command))

  ;; bind keys from table

#+END_SRC

***** Quoting regions

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (defun hpl/current-quotes-char ()
    "Gets the current quotes character."
    (nth 3 (syntax-ppss)))

  (defalias 'point-is-in-string-p 'hpl/current-quotes-char)

  (defun hpl/move-point-forward-out-of-string ()
    (while (point-is-in-string-p) (forward-char)))

  (defun hpl/move-point-backward-out-of-string ()
    (while (point-is-in-string-p) (backward-char)))

  (defun hpl/alternate-quotes-char ()
    "Gets the alternate quotes character."
    (if (eq ?' (hpl/current-quotes-char)) ?\" ?'))

  (defun hpl/toggle-quotes ()
    (interactive)
    (if (point-is-in-string-p)
        (let ((old-quotes (char-to-string (hpl/current-quotes-char)))
  	    (new-quotes (char-to-string (hpl/alternate-quotes-char)))
  	    (start (make-marker))
  	    (end (make-marker)))
  	(save-excursion
  	  (hpl/move-point-forward-out-of-string)
  	  (backward-delete-char 1)
  	  (set-marker end (point))
  	  (insert new-quotes)
  	  (hpl/move-point-backward-out-of-string)
  	  (delete-char 1)
  	  (insert new-quotes)
  	  (set-marker start (point))
  	  (replace-string new-quotes (concat "\\" new-quotes) nil start end)
  	  (replace-string (concat "\\" old-quotes) old-quotes nil start end)))
      (error "Point isn't in a string")))

  ;; bind-keys-from-table

#+END_SRC

***** Whitespace

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (defun hpl/indent-buffer ()
    "Indent the current buffer."
    (interactive)
    (indent-region (point-min) (point-max)))

  (defun hpl/cleanup-whitespace ()
    "Replace tabs and indent buffer."
    (interactive)
    (save-excursion
      (beginning-of-buffer)
      (while (re-search-forward "\t" nil t)
        (replace-match "        "))
      (hpl/indent-buffer)))

  (bind-key "C-c w" 'hpl/cleanup-whitespace)


#+END_SRC

