init.el

;; [[file:../Emacs.org::*Helper functions][Helper functions:1]]
(setq *spell-check-support-enabled* nil) ;; Enable with 't if you prefer

(setq *is-macos* (eq system-type 'darwin))
(setq *is-windows* (memq system-type '(windows-nt ms-dos cygwin)))
(setq *is-linux* (eq system-type 'gnu/linux))

(defun hplogsdon/reload-user-init-file ()
  "Reload the init file"
  (interactive)
  (load-file user-init-file))

(defun hplogsdon/find-init-file ()
  (interactive)
  (let ((this-init-file "~/.emacs.d/init.el"))
	(find-file this-init-file)))

(bind-key "C-c l" 'hplogsdon/reload-user-init-file)

;; Adjust garbage collection threshold for early startup (see gcmh below)
(setq gc-cons-threshold (* 128 1024 1024))

;; Process performance tuning
(setq read-process-output-max (* 4 1024 1024))
(setq process-adaptive-read-buffering nil)
;; Helper functions:1 ends here

;; [[file:../Emacs.org::*Bootstrapping][Bootstrapping:1]]
;; Set user custom file
(setq custom-file (locate-user-emacs-file "custom.el"))
;; Bootstrapping:1 ends here

;; [[file:../Emacs.org::*Package Management][Package Management:1]]
;; Set straight.el default config before bootstrapping
(setq straight-use-package-by-default t                 ; use-package defaults to straight.el
      straight-recipes-gnu-elpa-use-mirror t            ; use straight's mirror of elpa
      straight-built-in-pseudo-packages                 ; dont auto-fetch these builtins
      '(dired
        emacs-lisp-mode
        inferior-lisp
        isearch
        use-package
        uniquify
        vc
        which-function-mode
        ))

;;; Standard package repositories
(setq package-user-dir (expand-file-name (format "elpa-%s.%s" emacs-major-version emacs-minor-version)
                                                 user-emacs-directory)
      package-archives '(("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("orgmode"      . "https://orgmode.org/elpa/")
                         ("nongnu"       . "https://elpa.nongnu.org/nongnu/")
                         ("tromey"       . "https://tromey.com/elpa/")
                         ("gnu"          . "https://elpa.gnu.org/packages/")
                         ("melpa"        . "https://melpa.org/packages/"))
      package-archive-priorities '(("melpa-stable" . 30)
                                   ("orgmode"      . 30)
                                   ("nongnu"       . 20) 
                                   ("tromey"       . 20)
                                   ("gnu"          .  0)
                                   ("melpa"        .  0)))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name 
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
       (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
          "https://radian-software.github.io/straight.el/install.el"
          'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq use-package-verbose t)
(straight-use-package 'use-package)

(require 'cl-lib)
;; Package Management:1 ends here

;; [[file:../Emacs.org::*Package helpers][Package helpers:1]]
;;; --- Package Helpers

(use-package diminish
  :ensure t)
;; Package helpers:1 ends here

;; [[file:../Emacs.org::*Helper functions and commands][Helper functions and commands:1]]
;;; --- Emacs-Lisp helper functions and commands

;; Delete the current file
(defun delete-this-file ()
  "Delete the current file, and kill the buffer."
  (interactive)
  (unless (buffer-file-name)
    (error "No file is currently being edited"))
  (when (yes-or-no-p (format "Really delete '%s'?"
                             (file-name-nondirectory buffer-file-name)))
    (delete-file (buffer-file-name))
    (kill-this-buffer)))


;; Rename the current file
(if (fboundp 'rename-visited-file)
    (defalias 'rename-this-file-and-buffer 'rename-visited-file)
  (defun rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "New name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (progn
        (when (file-exists-p filename)
          (rename-file filename new-name 1))
        (set-visited-file-name new-name)
        (rename-buffer new-name)))))
;; Helper functions and commands:1 ends here
