README.org
**** Lisp directory (aka, `vendor')

Prepares the "site-lisp" directory for later use. Think `site-packages` in Python, or `vendor` in older Ruby projects. If we need to install an Elisp module into Emacs, but we don't want to consider it a part of our configuration, we can stick it in =~/.emacs.d/site-lisp/=, and be sure it will be available later.

We'll still need to `require' it, but we've recursively added anything checked out into that directory into our load path, so it shouldn't complain much.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Support elisp manually installed in the site-lisp dir

  ;; This must come before `elpa', as it may provide package.el
  ;; or equivalent functions

  ;; Set load path
  (require 'cl-lib)

  (defun sanityinc/add-subdirs-to-load-path (parent-dir)
    "Add every non-hidden subdir of PARENT-DIR to `load-path'."
    (let ((default-directory parent-dir))
      (setq load-path
  	  (append
  	   (cl-remove-if-not
  	    #'file-directory-p
  	    (directory-files (expand-file-name parent-dir) t "^[^\\.]"))
  	   load-path))))

  ;; Add both site-lisp and its immediate subdirs to `load-path'
  (let ((site-lisp-dir (expand-file-name "site-lisp/" user-emacs-directory)))
    (push site-lisp-dir load-path)
    (sanityinc/add-subdirs-to-load-path site-lisp-dir))

  ;;; Utilities for grabbing upstream libs
  (defun site-lisp-dir-for (name)
    (expand-file-name (format "site-lisp/%s" name) user-emacs-directory))

  (defun site-lisp-library-el-path (name)
    (expand-file-name (format "%s.el" name (site-lisp-dir-for name))))

  (defun download-site-lisp-module (name url)
    (let ((dir (site-lisp-dir-for name)))
      (message "Downloading %s from %s" name url)
      (unless (file-directory-p dir)
        (make-directory dir t))
      (add-to-list 'load-path dir)
      (let ((el-file (site-lisp-library-el-path name)))
        (url-copy-file url el-file t nil)
        el-file)))

  (defun ensure-lib-from-url (name url)
    (unless (site-lisp-library-loadable-p name)
      (byte-compile-file (download-site-lisp-module name url))))

  (defun site-lisp-library-loadable-p (name)
    "Return whether or not the library `name' can be loaded from a source file
  under ~/.emacs.d/site-lisp/NAME"
    (let ((f (locate-library (symbol-name name))))
      (and f (string-prefix-p (file-name-as-directory (site-lisp-dir-for name)) f))))

#+END_SRC

**** Exec Path

Exec path from shell ensures environment variables inside Emacs look the same as in the user's shell. Specifically on macOS, an Emacs instance may be launched as a GUI app and not inherit the appropriate default terminal environment variables. Similarly, if launched from `launchd` or `systemd` as a daemon, it will launch with some basic default encironment variables.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Setup exec-path to help Emacs find packages

  (when (or (memq window-system '(mac ns x pgtk))
  	  (unless (memq system-type '(ms-dos windows-nt))
  	    (daemonp)))
    (use-package exec-path-from-shell
      :ensure t
      :pin melpa-stable
      :config
      (exec-path-from-shell-initialize)
      (dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO" "LANG" "LC_CTYPE" "NIX_SSL_CERT_FILE" "NIX_PATH"))
        (add-to-list 'exec-path-from-shell-variables var))))

#+END_SRC

**** Performance tuning

Enforce a sneaky Garbage Collection Strategy to minimize GC interference with User activity. It attempts to set a high threshold trigger when Emacs is in use, but lowers it when Emacs is at idle. While useful, it is a bit of a hack.

If Emacs is used on a system with high memory pressure, and Emacs is exhibiting strange memory behavior, look here first.

- https://github.com/matthewbauer/bauer/blob/8d45ce0/README.org#L1229

Turning this off for now. Having loading issues with it.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Performance tuning

  ;; General performance tuning with the Garbage Collector Magic Hack
  (use-package gcmh
    :ensure t
    :demand t
    :diminish (gcmh-mode)
    :config
    (gcmh-mode 1)
    :init
    (setq gcmh-idle-delay 'auto)
    (setq gcmh-auto-idle-delay-factor 10)
    (setq gcmh-high-cons-threshold (* 128 1024 1024)))

  (setq jit-lock-defer-time 0)
#+END_SRC


** Package Config

*** UI Configuration


**** Frame Hooks

Creates a couple conditional window-system or tty/console hooks that execute after a new frame is created.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Provide specific hooks for GUI/TTY frame creation
  (defvar after-make-console-frame-hooks '()
    "Hooks to run after creating a new TTY frame")

  (defvar after-make-window-system-frame-hooks '()
    "Hooks to run after creating a new window-system frame")

  (defun run-after-make-frame-hooks (frame)
    "Run configured hooks in response to the newly-created FRAME
  Selectively runs either `after-make-console-frame-hooks' or
  `after-make-window-system-frame-hooks'."
    (with-selected-frame frame
      (run-hooks (if window-system
  		   'after-make-window-system-frame-hooks
  		 'after-make-console-frame-hooks))))

  (add-hook 'after-make-frame-functions 'run-after-make-frame-hooks)

  (defconst sanityinc/initial-frame (selected-frame)
    "The frame (if any) active during Emacs initialization.")

  (add-hook 'after-init-hook
  	  (lambda () (when sanityinc/initial-frame
  		       (run-after-make-frame-hooks sanityinc/initial-frame))))

#+END_SRC

**** XTerm

Helps integrate Emacs with xterm and similar Term emulators

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Integrate with terminals such as xterm

  (global-set-key [mouse-4] (lambda () (interactive) (scroll-down 1)))
  (global-set-key [mouse-5] (lambda () (interactive) (scroll-up 1)))

  (autoload 'mwheel-install "mwheel")

  (defun sanityinc/console-frame-setup ()
    (xterm-mouse-mode 1)
    (mwheel-install))


  (add-hook 'after-make-console-frame-hooks 'sanityinc/console-frame-setup)

#+END_SRC

**** Fonts, Emojis, Icons, etc.

***** Fonts

Font family that we'll use.
- [[https://github.com/tonsky/FiraCode][Fira Code]] (12)
- [[https://www.jetbrains.com/lp/mono/][JetBrains Mono]] (10, 11)


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Fonts
  (if *is-macos*
      (progn
        (set-face-attribute 'default nil :font "JetBrainsMonoNL Nerd Font")
        (set-frame-font "JetBrainsMonoNL Nerd Font" nil t))
    (progn
      (set-face-attribute 'default nil :font "JetBrains Mono NL Nerd Font")
      (set-frame-font "JetBrains Mono NL Nerd Font" nil t)))


  ;;(set-face-attribute 'default nil
  ;;      :font "JetBrains Mono NL Nerd Font"
  ;;      :weight 'extrabold
  ;;      :height 110)

  ;;(set-face-attribute 'fixed-pitch nil
  ;;      :font "JetBrains Mono Nerd Font"
  ;;      :weight 'bold
  ;;      :height 110)

#+END_SRC

***** Ligatures

We are ripping off the ligatures from the Fira Code font using the =fira-code-mode= minor mode.

Required installation of the Fira Code Regular Symbol Font with =M-x fira-code-mode-install-fonts=.

This provides us with =lambda= > =λ= conversions, for example.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package fira-code-mode
    :straight t
    :demand t
    :if (display-graphic-p)
    :hook prog-mode
    :custom (fira-code-mode-disabled-ligatures '("[]" ":" "x"))
    :config (fira-code-mode-set-font))

#+END_SRC

***** Emoji

This sets up emoji rendering. Required installation of the [[github.com/googlefonts/noto-emoji][Noto Emoji]] font for Linux

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;; Default Windows emoji font
  (when (member "Segoe UI Emoji" (font-family-list))
    (set-fontset-font t 'symbol (font-spec :family "Segoe UI Emoji") nil 'prepend)
    (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Segoe UI Emoji"))

  (when (member "Noto Color Emoji" (font-family-list))
    (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
    (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Noto Color Emoji"))

  (when (member "Apple Color Emoji" (font-family-list))
    (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)
    (set-fontset-font "fontset-default" '(#xFF00 . #xFE0F) "Apple Color Emoji"))

#+END_SRC

***** Icons

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Icons

  (use-package nerd-icons)

  (use-package nerd-icons-completion
    :straight
    (nerd-icons-completion :type git :host github :repo "rainstormstudio/nerd-icons-completion")

    :hook
    ((marginalia-mode . nerd-icons-completion-marginalia-setup))

    :config
    (nerd-icons-completion-mode))

  (use-package nerd-icons-dired
    :straight
    (nerd-icons-dired :type git :host github :repo "rainstormstudio/nerd-icons-dired")

    :hook
    ((dired-mode . nerd-icons-dired-mode)))

  (use-package nerd-icons-ibuffer
    :straight
    (nerd-icons-ibuffer :type git :host github :repo "seagle0128/nerd-icons-ibuffer")

    :hook
    ((ibuffer-mode . nerd-icons-ibuffer-mode)))

  (use-package nerd-icons-corfu
    :straight
    (nerd-icons-corfu :type git :host github :repo "LuigiPiucco/nerd-icons-corfu")

    :autoload nerd-icons-corfu-formatter
    :after corfu

    :init
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

#+END_SRC

**** UI Elements

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Line Numbers

  (setq column-number-mode t)
  (setq line-number-mode t)
  (global-display-line-numbers-mode t)

  ;; Defaults to 70. 80 is better.
  (setq fill-column 80)

  ;; Sentences do not need double spaces to end.
  (set-default 'sentence-end-double-space nil)

  ;; disable line numbers where they don't make sense or arent useful.
  (dolist (mode '(org-mode-hook
  		term-mode-hook
  		treemacs-mode-hook
  		dired-mode-hook
  		eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode nil))))

#+END_SRC

**** Themes

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Theming

  (use-package monokai-pro-theme
    :ensure t
    :init
    (load-theme 'monokai-pro t))

#+END_SRC

