init.el

;; [[file:../Emacs.org::*Lisp directory (aka, `vendor')][Lisp directory (aka, `vendor'):1]]
;;; --- Support elisp manually installed in the site-lisp dir

;; This must come before `elpa', as it may provide package.el
;; or equivalent functions

;; Set load path
(require 'cl-lib)

(defun sanityinc/add-subdirs-to-load-path (parent-dir)
  "Add every non-hidden subdir of PARENT-DIR to `load-path'."
  (let ((default-directory parent-dir))
    (setq load-path
          (append
           (cl-remove-if-not
            #'file-directory-p
            (directory-files (expand-file-name parent-dir) t "^[^\\.]"))
           load-path))))

;; Add both site-lisp and its immediate subdirs to `load-path'
(let ((site-lisp-dir (expand-file-name "site-lisp/" user-emacs-directory)))
  (push site-lisp-dir load-path)
  (sanityinc/add-subdirs-to-load-path site-lisp-dir))

;;; Utilities for grabbing upstream libs
(defun site-lisp-dir-for (name)
  (expand-file-name (format "site-lisp/%s" name) user-emacs-directory))

(defun site-lisp-library-el-path (name)
  (expand-file-name (format "%s.el" name (site-lisp-dir-for name))))

(defun download-site-lisp-module (name url)
  (let ((dir (site-lisp-dir-for name)))
    (message "Downloading %s from %s" name url)
    (unless (file-directory-p dir)
      (make-directory dir t))
    (add-to-list 'load-path dir)
    (let ((el-file (site-lisp-library-el-path name)))
      (url-copy-file url el-file t nil)
      el-file)))

(defun ensure-lib-from-url (name url)
  (unless (site-lisp-library-loadable-p name)
    (byte-compile-file (download-site-lisp-module name url))))

(defun site-lisp-library-loadable-p (name)
  "Return whether or not the library `name' can be loaded from a source file
under ~/.emacs.d/site-lisp/NAME"
  (let ((f (locate-library (symbol-name name))))
    (and f (string-prefix-p (file-name-as-directory (site-lisp-dir-for name)) f))))
;; Lisp directory (aka, `vendor'):1 ends here

;; [[file:../Emacs.org::*Exec Path][Exec Path:1]]
;;; --- Setup exec-path to help Emacs find packages

(when (or (memq window-system '(mac ns x pgtk))
          (unless (memq system-type '(ms-dos windows-nt))
            (daemonp)))
  (use-package exec-path-from-shell
    :ensure t
    :pin melpa-stable
    :config
    (exec-path-from-shell-initialize)
    (dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO" "LANG" "LC_CTYPE" "NIX_SSL_CERT_FILE" "NIX_PATH"))
      (add-to-list 'exec-path-from-shell-variables var))))
;; Exec Path:1 ends here

;; [[file:../Emacs.org::*Performance tuning][Performance tuning:1]]
;;; --- Performance tuning

;; General performance tuning with the Garbage Collector Magic Hack
(use-package gcmh
  :ensure t
  :demand t
  :diminish (gcmh-mode)
  :config
  (gcmh-mode 1)
  :init
  (setq gcmh-idle-delay 'auto)
  (setq gcmh-auto-idle-delay-factor 10)
  (setq gcmh-high-cons-threshold (* 128 1024 1024)))

(setq jit-lock-defer-time 0)
;; Performance tuning:1 ends here

;;; --- Provide specific hooks for GUI/TTY frame creation
(defvar after-make-console-frame-hooks '()
  "Hooks to run after creating a new TTY frame")

(defvar after-make-window-system-frame-hooks '()
  "Hooks to run after creating a new window-system frame")

(defun run-after-make-frame-hooks (frame)
  "Run configured hooks in response to the newly-created FRAME
Selectively runs either `after-make-console-frame-hooks' or
`after-make-window-system-frame-hooks'."
  (with-selected-frame frame
    (run-hooks (if window-system
                   'after-make-window-system-frame-hooks
                 'after-make-console-frame-hooks))))

(add-hook 'after-make-frame-functions 'run-after-make-frame-hooks)

(defconst sanityinc/initial-frame (selected-frame)
  "The frame (if any) active during Emacs initialization.")

(add-hook 'after-init-hook
          (lambda () (when sanityinc/initial-frame
                  (run-after-make-frame-hooks sanityinc/initial-frame))))

;;; --- Integrate with terminals such as xterm

(global-set-key [mouse-4] (lambda () (interactive) (scroll-down 1)))
(global-set-key [mouse-5] (lambda () (interactive) (scroll-up 1)))

(autoload 'mwheel-install "mwheel")

(defun sanityinc/console-frame-setup ()
  (xterm-mouse-mode 1)
  (mwheel-install))


(add-hook 'after-make-console-frame-hooks 'sanityinc/console-frame-setup)

;;; --- Theming

(use-package monokai-pro-theme
  :ensure t
  :init
  (load-theme 'monokai-pro t))

(use-package nerd-icons)

(use-package nerd-icons-completion
  :straight
  (nerd-icons-completion :type git :host github :repo "rainstormstudio/nerd-icons-completion")

  :hook
  ((marginalia-mode . nerd-icons-completion-marginalia-setup))

  :config
  (nerd-icons-completion-mode))

(use-package nerd-icons-dired
  :straight
  (nerd-icons-dired :type git :host github :repo "rainstormstudio/nerd-icons-dired")

  :hook
  ((dired-mode . nerd-icons-dired-mode)))

(use-package nerd-icons-ibuffer
  :straight
  (nerd-icons-ibuffer :type git :host github :repo "seagle0128/nerd-icons-ibuffer")

  :hook
  ((ibuffer-mode . nerd-icons-ibuffer-mode)))

(use-package nerd-icons-corfu
  :straight
  (nerd-icons-corfu :type git :host github :repo "LuigiPiucco/nerd-icons-corfu")

  :autoload nerd-icons-corfu-formatter
  :after corfu

  :init
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
