README.org
**** flymake

Style and Syntax Checking. =flymake= does a good job with this, and it's builtin. Further down, eglot builds on this as well for LSP server integration.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Configure flymake global behavior

  (use-package flymake
    :ensure nil
    :hook (prog-mode . flymake-mode)
    :bind (:map flymake-mode-map
  	      ("C-c l" . flymake-show-buffer-diagnostics)
  	      ("C-c n" . flymake-goto-next-error)
  	      ("C-c p" . flymake-goto-prev-error)
  	      ("C-c c" . flymake-start)))


#+END_SRC

**** xref

Jump to definitions and references

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Cross Reference (xref) configuration

  (use-package xref
    :straight t
    :defer t
    :bind (("s-[" . #'xref-go-back)
  	 ("s-]" . #'xref-go-forward)
  	 ("C-c r" . #'xref-find-references)
  	 ("C-c d" . #'xref-find-definitions))
    :config (add-to-list 'xref-prompt-for-identifier #'xref-find-references 'append)
    :custom
    (xref-auto-jump-to-first-xref t))

#+END_SRC

**** Language Server Protocol

Moving to the builtin =lsp-mode= package. The main benefit to using Language Server Protocol (LSP)
to configure the management of various programming languages is that LSP servers are also used by
other text editors, increasing the compatibility and contributions to those packages. What could be
better than benefiting from the larger community while keeping this text editor.

We'll need a Language Server Protocol Client to use different LSP servers according to the programming
languages that we'd like to use.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- LSP Support

  (use-package lsp-mode
    :after (:all xref)
    :commands (lsp lsp-deferred)
    :hook ((prog-mode . lsp-deferred))

    :custom
    (lsp-enable-folding nil)
    (lsp-enable-links nil)
    (lsp-enable-snippet nil)
    (lsp-keymap-prefix "C-c ;")
    (lsp-session-file (expand-file-name "lsp-session-v1" emacs-user-directory))
    (read-process-output-max (* 1024 1024)))

#+END_SRC

In addition to =lsp-mode= we can use =lsp-ui= to display additional information, such as documentation,
when hovering a variable or function.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package lsp-ui
    :after lsp-mode
    :commands lsp-ui-mode
    :hook (lsp-mode . lsp-ui-mode)
    :custom-face
    (lsp-ui-doc-background ((t (:background nil))))
    (lsp-ui-doc-header ((t (:inherit (font-lock-string-face italic)))))
    :bind (:map lsp-ui-mode-map
  	      ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
  	      ([remap xref-find-references] . lsp-ui-peek-find-references)
  	      ("C-c u" . lsp-ui-imenu))
    :custom
    (lsp-ui-doc-enable t)
    (lsp-ui-doc-header t)
    (lsp-ui-doc-include-signature t)
    (lsp-ui-doc-position 'top)
    (lsp-ui-doc-border (face-foreground 'default))
    (lsp-ui-sideline-enable t)
    (lsp-ui-sideline-ignore-duplicate t)
    (lsp-ui-sideline-show-code-actions nil))

#+END_SRC

We could also use =consult-lsp= here if we were using it instead of ibuffer.


=dap-mode= is the Debug Adapter Protocol wire protocol for communication between clients and Debug servers.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package dap-mode
    :after lsp-mode
    :config
    (dap-mode t)
    (dap-ui-mode t))
    
#+END_SRC

**** recentf

Recent File tracking buffer

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Settings for tracking recent files

  (use-package recentf
    :defer t
    :init (recentf-mode)
    :config
    (setq recentf-max-saved-items 200
  	recentf-auto-cleanup 300
  	recentf-exclude (list "\\.git/.*\\'"  ; Git contents
  			      "/elpa/.*\\'"   ; Package files
  			      ".*\\.gz\\'"
  			      "TAGS"
  			      (concat package-user-dir "/.*-autoloads\\.el\\'")
  			      "ido.last")))


#+END_SRC

**** minibuffer

TODO load vertico/embark/consult/marginalia ?

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;;  ---

  (defun switch-to-minibuffer ()
    "Switch to minibuffer."
    (interactive)
    (if (active-minibuffer-window)
        (select-window (active-minibuffer-window))
      (error "Minibuffer is not active")))

  (bind-key "M-m" 'switch-to-minibuffer)


#+END_SRC


*** Editing Help

Autocomplete, intellisense-like stuff, etc.

**** Auto Complete

***** DONE dabbrev
CLOSED: [2025-09-17 Wed 17:28]

I have no idea how =dabbrev=, =hippy-exp= and =corfu= play nicely together. It's something I need to
learn more about

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package dabbrev
    ;; Swap M-/ and C-M-/
    :bind
    (("M-/" . dabbrev-completion)
     ("C-M-/" . dabbrev-expand))

    ;; Other useful Dabbrev configuration
    :custom
    (dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'"))
    (setq dabbrev-case-fold-search nil))

#+END_SRC

***** DONE hippie-expand
CLOSED: [2025-09-17 Wed 14:37]

Hippie Expand is a "powerful expansion and completion" tool

TODO Add `emmet-mode` here ?

- This has several custom expansion functions for Lisps.
  https://github.com/benjamin-asdf/dotfiles/blob/f10b653c044b605af6fd0b634027ecd40c383754/mememacs/.emacs-mememacs.d/init.el#L510


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Settings for hippie-expand

  (use-package hippie-exp
    :ensure nil
    :bind ([remap dabbrev-expand] . hippie-expand)
    :commands (hippie-expand)

    :init
    (defadvice hippie-expand (around hippie-expand-case-fold activate)
      "Try to do case-sensitive matching (not effective with all functions)."
      (let ((case-fold-search nil))
        ad-do-it))

    :config
    (setq hippie-expand-try-functions-list
  	'(;; Try to expand word "dynamically", searching just the current buffer
  	  try-expand-dabbrev
  	  ;; Try to expand word "dynamically", searching ...?
  	  try-expand-dabbrev-visible
  	  ;; Try to expand word "dynamically", searching all other buffers.
  	  try-expand-dabbrev-all-buffers
  	  ;; Try to expand word "dynamically", searching the kill ring
  	  try-expand-dabbrev-from-kill
  	  ;; Try to complete text as a filename, as many characters are unique
  	  try-complete-file-name-partially
  	  ;; Try to complete text as a filename.
  	  try-complete-file-name
  	  ;; Try to complete before point according to all abbrev tables.
  	  try-expand-all-abbrevs
  	  ;; Try to complete the current line to a list in the buffer
  	  try-expand-list
  	  ;; Try to complete the current line to a line in the buffer
  	  try-expand-line
  	  ;; Try to complete the current line to an entire line in a different buffer.
  	  try-expand-line-all-buffers
  	  ;; Try to complete text using flyspell
  	  ;try-flyspell
  	  ;; Try to complete as an Emacs Lisp symbol, as many characters are unique.
  	  try-complete-lisp-symbol-partially
  	  ;; Try to complete word as an Emacs Lisp symbol.
  	  try-complete-lisp-symbol)))


#+END_SRC

***** DONE corfu
CLOSED: [2025-09-17 Wed 15:19]

Corfu helps with interactive completion in buffers. We use this with the builtin DAbbrev.

see: [https://github.com/junio256/dotemacs/main/cfg.org]
see: [https://github.com/e-denny/.emacs.d/blob/a0a46fa/lisp/init-corfu.el#L93]


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Interactive completion in buffers

  ;; Corfu is responsible for interactive completion
  (use-package corfu
    :init
    (global-corfu-mode)

    :custom
    (corfu-auto nil)     ; Popup appears automatically
    (corfu-auto-delay 0.2)    ;
    (corfu-auto-prefix 3)
    (corfu-quit-no-match 'separator)
    (corfu-preview-current t))    ; Show candidate on pointer


#+END_SRC

***** Cape

Completion At Point Extensions (CAPE), used in conjunction with Corfu, Company, and dabbrev.


https://github.com/e-denny/.emacs.d/blob/a0a46fa063f5cac0ff5cd79ce897513bc9a1146a/lisp/init-corfu.el#L73


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Cape

  ;; Adds more completion source backends for Corfu
  (use-package cape
    :bind
    (("C-c p" . cape-prefix-map)
     ("C-c M-p" . completion-at-point))

    :init
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev))


  ;; Adjust some of the emacs defaults if we load this module
  (use-package emacs
    :ensure nil
    :custom
    ;; limit the height of the *Completions* buffer
    (completions-max-height 15)
    ;; Use TAB for completions first, then indent
    (tab-always-indent 'complete))


#+END_SRC


**** Window Management


***** DONE windows
CLOSED: [2025-09-17 Wed 18:04]

Most of the time, when we split a window we want to focus to follow into the split to perform an action. By default GNU Emacs doesn't give the focus to the new window. This should easily enable this behavior.

This also adds [[https://github.com/dimitri/switch-window][Switch Window]], which shows the window number while hiding it's content, which is more convenient when moving from window-to-window to locate the one we're looking for.

See: https://www.masteringemacs.org/article/demystifying-emacs-window-manager
See: https://github.com/loispostula/.emacs.d/blob/c10ee86/config.org#window


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Working with windows within frames

  ;; Show window number when switching
  (use-package switch-window
    :ensure t
    :defer t
    :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
  	'("a" "s" "d" "f" "g" "h" "i" "j" "k"))
    :bind
    (;; TODO: validate these
     ("C-x 0" . switch-window-then-delete)
     ("C-x 1" . switch-window-then-maximum)
     ("C-x 2" . switch-window-then-split-below)
     ("C-x 3" . switch-window-then-split-right)
     ("C-x o" . switch-window)
     ("C-x w" . switch-window-then-swap-buffer)
     ("C-<up>" . windmove-up)
     ("C-<down>" . windmove-down)
     ([remap other-window] . switch-window)))

  ;; Helps move buffers around
  (use-package buffer-move
    :ensure t
    :defer t
    :bind
    (;; Steal VIM movement keys.
     ("C-S-h" . #'buf-move-left )
     ("C-S-j" . #'buf-move-down)
     ("C-S-k" . #'buf-move-up)
     ("C-S-l" . #'buf-move-right)))


#+END_SRC

***** DONE sessions
CLOSED: [2025-09-18 Thu 15:28]

Saves a list of files to a cache file in the emacs dir, and can restore them later

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Save and restore editor sessions between restarts

  ;; save a list of open files in ~/.emacs.d/.emacs.desktop
  (setq desktop-path (list user-emacs-directory)
        desktop-auto-save-timeout 600)
  (desktop-save-mode 1)

  (defun sanityinc/desktop-time-restore (orig &rest args)
    (let ((start-time (current-time)))
      (prog1
  	(apply orig args)
        (message "Desktop restored in %.2fms"
  	       (sanityinc/time-subtract-millis (current-time)
  					       start-time)))))
  (advice-add 'desktop-read :around 'sanityinc/desktop-time-restore)

  (defun sanityinc/desktop-time-buffer-create (orig ver filename &rest args)
    (let ((start-time (current-time)))
      (prog1
  	(apply orig ver filename args)
        (message "Desktop: %.2fms to restore %s"
  	       (sanityinc/time-subtract-millis (current-time)
  					       start-time)
  	       (when filename
  		 (abbreviate-file-name filename))))))
  (advice-add 'desktop-create-buffer :around 'sanityinc/desktop-time-buffer-create)

  ;; Restore histories and registers after saving
  (setq-default history-length 1000)
  (add-hook 'after-init-hook 'savehist-mode)

  (use-package session
    :config
    (setq session-save-file (locate-user-emacs-file ".session"))
    (setq session-name-disable-regexp "\\(?:\\`'/tmp\\|\\.git/[A-Z_]+\\'\\)")
    (setq session-save-file-coding-system 'utf-8)

    (add-hook 'after-init-hook 'session-initialize)

    (setq desktop-globals-to-save
  	'((compile-history      . 30)
  	  (dired-regexp-history . 20)
  	  (file-name-history    . 100)
  	  (grep-find-history    . 30)
  	  (grep-history         . 30)
  	  (minibuffer-history   . 50)
  	  (org-tags-history     . 50)
  	  (regexp-history       . 60)
  	  (regexp-search-ring   . 20)
  	  (search-ring          . 20))))


#+END_SRC


*** Editing

**** DONE Multiple Major Modes.
CLOSED: [2025-09-18 Thu 14:44]

Allows for multiple major modes to be active in different regions of a single buffer. This helps show code snippets in Markdown and the like.

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;; --- Multiple Major Modes support

  (use-package mmm-mode
    :ensure t
    :defer t
    :config
    (setq mmm-global-mode 'buffers-with-submode-classes)
    (setq mmm-submode-mode-line-format "~M > [~m]"
  	mmm-primary-mode-display-name t
  	mmm-buffer-mode-display-name t)
    (setq mmm-submode-decoration-level 3)

    ;;(mmm-add-mode-ext-classes 'html-mode "\\.php\\'" 'html-php)

    (unless (boundp 'editing-prefix)
      (define-prefix-command 'editing-prefix))
    (define-key editing-prefix (kbd "m") 'mmm-mode) ;; enable mmm on region

    ;; Submode classes
    ;;(mmm-add-classes
    ;; '((embedded-css
    ;;   :submode css
    ;;   :face mmm-declaration-submode-face
    ;;    :front "<style[^>]&>"
    ;;   :back "</style>")))

    ;; Submode groups
    ;;(mmm-add-to-group 'html-js '((js-html
    ;;                              :submode javascript
    ;;                              :face mmm-code-submode-face
    ;;                              :front "%=%"
    ;;                              :back "%=%"
    ;;                              :end-not-begin t)))
    )

#+END_SRC

