init.el

;;; --- Configure flymake global behavior

(use-package flymake
  :ensure nil
  :hook (prog-mode . flymake-mode)
  :bind (:map flymake-mode-map
              ("C-c l" . flymake-show-buffer-diagnostics)
              ("C-c n" . flymake-goto-next-error)
              ("C-c p" . flymake-goto-prev-error)
              ("C-c c" . flymake-start)))

;;; --- Cross Reference (xref) configuration

(use-package xref
  :straight t
  :defer t
  :bind (("s-[" . #'xref-go-back)
         ("s-]" . #'xref-go-forward)
         ("C-c r" . #'xref-find-references)
         ("C-c d" . #'xref-find-definitions))
  :config (add-to-list 'xref-prompt-for-identifier #'xref-find-references 'append)
  :custom
  (xref-auto-jump-to-first-xref t))

;;; --- Settings for tracking recent files

(use-package recentf
  :defer t
  :init (recentf-mode)
  :config
  (setq recentf-max-saved-items 200
        recentf-auto-cleanup 300
        recentf-exclude (list "\\.git/.*\\'"  ; Git contents
                              "/elpa/.*\\'"   ; Package files
                              ".*\\.gz\\'"
                              "TAGS"
                              (concat package-user-dir "/.*-autoloads\\.el\\'")
                              "ido.last")))

;;;  --- 

(defun switch-to-minibuffer ()
  "Switch to minibuffer."
  (interactive)
  (if (active-minibuffer-window)
      (select-window (active-minibuffer-window))
    (error "Minibuffer is not active")))

(defun kill-this-buffer ()
  (interactive)
  (kill-buffer (current-buffer)))

(bind-key "M-m" 'switch-to-minibuffer)
(bind-key "C-c C-k" 'kill-this-buffer)
