README.org
**** editing-utils

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Day-to-Day editing helpers

  ;; Advises kill-region "C-w" so that if no region is selected, it kills/copies the current line.
  (advice-add 'kill-region :before
  	    (lambda (&rest args)
  	      "When called interactively with no active region, kill a single line instead."
  	      (when (called-interactively-p 'interactive)
  		(unless mark-active
  		  (setq args (list (line-beginning-position)
  				   (line-beginning-position 2)))))))



#+END_SRC

**** DONE whitespace
CLOSED: [2025-09-18 Thu 14:44]

Whitespace should be visible immediately. The `whitespace` package helps to
display it.

Further, whitespace can also be cleaned up automatically with
`whitespace-cleanup`


#+NAME: whitespace-bindings-table
| Scope  | Binding | Function                |
|--------+---------+-------------------------|
| global | C-c T w | whitespace-mode         |
| global | C-c T w | whitespace-cleanup-mode |
| global | C-c w i | whitespace-cleanup      |

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Special handling for whitespace

  ;; Show whitespace issues
  (use-package whitespace
    :diminish (global-whitespace-mode
  	     whitespace-mode
  	     whitespace-newline-mode)
    :bind
    ("C-c T w" . whitespace-mode)
    :hook
    (prog-mode . whitespace-mode)

    :config
    (setq whitespace-line-column 120
  	whitespace-style '(face
  			   tabs
  			   indent
  			   tab-mark
  			   empty
  			   trailing
  			   lines-tail)))

  (use-package whitespace-cleanup-mode
    :ensure t
    :diminish whitespace-cleanup-mode

    :bind (("C-c T W" . whitespace-cleanup-mode)
  	 ("C-c e w" . whitespace-cleanup))

    :hook
    (prog-mode . whitespace-cleanup-mode)

    :config
    (global-whitespace-cleanup-mode 1))

  (global-set-key [remap just-one-space] 'cycle-spacing)


#+END_SRC


*** Source Control


**** Version Control

Non-specific Version Control support. Diff-hl Highlights diff files, which all source control is essentially an extension of.


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Version control support

  ;; program-specific version control packages are configured separately.
  ;; see `git', for example

  (use-package diff-hl
    :ensure t
    :after (dired)
    :hook ((prog-mode  . diff-hl-mode)
  	 (dired-mode . diff-hl-dired-mode)
  	 (after-init . global-diff-hl-mode))
    :init
    (defconst hplogsdon/diff-hl-mode-hooks '(emacs-lisp-mode-hook
  					   conf-space-mode-hook ; .tmux.conf
  					   markdown-mode-hook
  					   css-mode-hook
  					   web-mode-hook
  					   sh-mode-hook
  					   python-mode-hook
  					   yaml-mode-hook ; tmuxp yaml configs
  					   c-mode-hook)
      "List of hook of major modes in which `diff-hl-mode' should be enabled.")
    (dolist (hook hplogsdon/diff-hl-mode-hooks)
      (add-hook hook #'diff-hl-flydiff-mode))

    :config
    (with-eval-after-load 'magit
      (add-hook 'magit-pre-refresh-hook #'diff-hl-magit-pre-refresh)
      (add-hook 'magit-post-refresh-hook #'diff-hl-magit-post-refresh))

    :custom
    (diff-hl-disable-on-remote t)
    (diff-hl-margin-symbols-alist
     '((insert . " ")
       (delete . " ")
       (change . " ")
       (unknown . "?")
       (ignored . "i"))))

  ;; TODO: diff-hl-hydra ?
  ;; (use-package diff-hl-hydra
  ;;   :after (hydra))

  (use-package vc
    :bind (("C-x v =" . hplogsdon/vc-diff)
  	 ("C-x v H" . vc-region-history)) ;; new command in emacs 25.x
    :config
    (defun hplogsdon/vc-diff (no-whitespace)
      "Call `vc-diff' as usual if buffer is not modified.
    If the buffer is modified (yet to be saved, dirty) call
    `diff-buffer-with-file'. If NO-WHITESPACE is non-nill, ignore
    all whitespace when doing diff."
      (interactive "P")
      (let* ((no-ws-switch '("-w"))
  	   (vc-git-diff-switches (if no-whitespace
  				     no-ws-switch
  				   vc-git-diff-switches))
  	   (vc-diff-switches (if no-whitespace
  				 no-ws-switch
  			       vc-diff-switches))
  	   (diff-switches (if no-whitespace
  			      no-ws-switch
  			    vc-diff-switches))
  	   ;; set `current-prefix-arg' no nil so that the HISTORIC arg of
  	   ;; `vc-diff' stays nil.
  	   current-prefix-arg)
        (if (buffer-modified-p)
  	  (diff-buffer-with-file (current-buffer))
  	(call-interactively #'vc-diff)))))

#+END_SRC

**** DONE git
CLOSED: [2025-09-18 Thu 15:29]

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Git SCM Support

  (use-package git-gutter
    :ensure t
    :defer t
    :hook (prog-mode . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 1))


  (use-package git-gutter-fringe
    :ensure t
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [244] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [244] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 244 240] nil nil 'bottom))


  (use-package git-modes
    :mode
    ("\\.?gitignore\\'"
     "\\.?gitignore_global\\'"
     "\\.?dockerignore\\'")
    :defer t)


  (use-package git-timemachine
    :bind
    (("C-x v t" . git-timemachine-toggle))
    :hook
    (git-timemachine-mode . display-line-numbers-mode))


  (use-package magit
    :ensure t
    :bind (("C-x g" . magit-status)
  	 :map magit-status-mode-map
  	 ("C-x C-k" . hpl/magit-kill-file-on-line)
  	 ("q" . hpl/magit-quit-session)
  	 ("W" . hpl/magit-toggle-whitespace))

    :config
    (progn
      (setq magit-auto-revert-mode nil)
      (setq magit-repository-directories '("~/Projects/"))

      ;(defadvice magit-status (around magit-fullscreen activate)
      ;  (unless (get-register :magit-fullscreen)
      ;    (window-configuration-to-register :magit-fullscreen))
      ;  ad-to-it
      ;  (delete-other-windows))

      (defun hpl/magit-kill-file-on-line ()
        ""
        (interactive)
        (magit-visit-item)
        (delete-current-buffer-file)
        (magit-refresh))

      (defun hpl/magit-quit-session ()
        "Restores the previous window configuration"
        (interactive)
        (kill-buffer)
        (jump-to-register :magit-fullscreen)
        (set-register :magit-fullscreen nil))

      (defun hpl/magit-toggle-whitespace ()
        ""
        (interactive)
        (if (member "-w" magit-diff-options)
  	  (hpl/magit-dont-ignore-whitespace)
  	(hpl/magit-ignore-whitespace)))

      (defun hpl/magit-dont-ignore-whitespace ()
        ""
        (interactive)
        (add-to-list 'magit-diff-options "-w")
        (magit-refresh))

      (defun hpl/magit-ignore-whitespace ()
        ""
        (interactive)
        (setq magit-diff-options (remove "-w" magit-diff-options))
        (magit-refresh))))


#+END_SRC

**** github

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Github integration

  ;; yagist
  ;; (use-package yagist)

  ;; github-clone
  ;; (use-package github-clone)

  ;; github-review
  ;; (use-package github-review)

  ;; todo: flymake-actionlint
  ;; todo: forge
  ;; todo: bug-reference-github

#+END_SRC

**** gitlab

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Gitlab Integration


#+END_SRC



*** Projects


**** ibuffer

TODO move to =consult-project-buffer= ? ibuffer is builtin, and maybe we should be think about using more builtin packages

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- iBuffer settings

  (use-package ibuffer
    :ensure nil
    :bind (("C-x C-b" . ibuffer))
    :commands (ibuffer-current-buffer
  	     ibuffer-find-file
  	     ibuffer-do-sort-by-alphabetic)

    :preface
    (defvar protected-buffers '("*scratch*" "*Messages*")
      "Buffers that cannot be killed")
    (defun hplogsdon/protected-buffers ()
      "Protect some buffers from being killed."
      (dolist (buffer protected-buffers)
        (with-current-buffer buffer
  	(emacs-lock-mode 'kill))))
    :init
    (use-package ibuffer-vc
      :commands (ibuffer-vc-set-filter-groups-by-vc-root)
      :custom
      (ibuffer-vc-skip-if-remote 'nil))

    (setq ibuffer-filter-group-name-face '(:inherit (font-lock-string-face bold)))
    (setq ibuffer-formats '((mark modified read-only locked
  				" " (name 35 35 :left :elide)
  				" " (size 9 -1 :right)
  				" " (mode 16 16 :left :elide)
  				" " filename-and-process)
  			  (mark modified read-only vc-status-mini
  				" " (name 22 22 :left :elide)
  				" " (size 9 -1 :right)
  				" " (mode 14 14 :left :elide)
  				" " (vc-status 12 12 :left)
  				" " vc-relative-file)
  			  (mark " " (name 16 -1) " " filename)))
    (setq ibuffer-saved-filter-groups '(("default"
  				       ("org" (or (mode .org-mode) (name . "^\\Org Mode")))
  				       ("emacs" (or (name . "^\\*scratch\\*$") (name . "\\*Messages\\*$")))
  				       ("dired" (mode . dired-mode))
  				       ("terminal" (name . "^\\*Help\\*$")))))
    (hplogsdon/protected-buffers)
    :config
    (add-hook 'ibuffer-mode-hook
  	    (lambda ()
  	      (ibuffer-switch-to-saved-filter-groups "default")
  	      (ibuffer-update nil t)
  	      (ibuffer-auto-mode 1)))


    (setq ibuffer-show-empty-filter-groups nil))


#+END_SRC


**** DONE projectile
CLOSED: [2025-09-19 Fri 07:55]

Projectile brings project-level facilities to Emacs such as grep, find, and replace.

#+BEGIN_QUOTE
Projectile is a project interaction library for Emacs. Its goal is to provide a
nice set of features operating on a project level without introducing external
dependencies (when feasible). For instance - finding project files has a
portable implementation written in pure Emacs Lisp without the use of FNU find
(but for performance sake an indexing mechanism backed by external commands
exists as well).

[[https://github.com/bbatsov/projectile][Bozhidar Batsov]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Projectile Project configuration
  (use-package projectile
    :ensure projectile
    :diminish projectile-mode

    :bind
    (("C-c p" . projectile-switch-project))

    :init
    (setq-default
     projectile-cache-file (expand-file-name ".projectile-cache" user-emacs-directory)
     projectile-keymap-prefix (kbd "C-c C-p")
     projectile-known-projects-file (expand-file-name ".projectile-bookmarks" user-emacs-directory))

    :config
    (projectile-global-mode 1)
    (setq projectile-enable-caching t
  	projectile-create-missing-test-files t
  	;;projectile-completion-system 'ivy
  	projectile-mode-line-prefix " Proj"
  	projectile-mode-line '(:eval (projectile-project-name))
  	projectile-use-git-grep t
  	projectile-commander-methods nil))


  (use-package ibuffer-projectile
    :after (projectile)
    :bind
    (:map ibuffer-mode-map
  	("c" . clean-buffer-list)
  	("n" . ibuffer-forward-filter-group)
  	("p" . ibuffer-backwards-filter-group))
    :hook
    ((ibuffer . (lambda ()
  		(ibuffer-projectile-set-filter-groups)
  		(unless (eq ibuffer-sorting-mode 'alphabetic)
  		  (ibuffer-do-sort-by-alphabetic))))))

#+END_SRC


*** File Types


**** TODO compile

**** TODO crontab

**** TODO textile

**** TODO markdown

To edit Markdown files, use 

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package markdown-mode
    :mode ("\\.\\(md\\|markdown\\)\\'"))
  
#+END_SRC

**** DONE csv
CLOSED: [2025-09-21 Sun 11:17]

Ergonomics. =csv-mode= provides color syntax when editing CSV files.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package csv-mode
    :mode ("\\.\\(csv\\|tsv\\)\\'"))
  
#+END_SRC

**** TODO javascript


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
    
#+END_SRC

