README.org
**** DONE orgmode
CLOSED: [2025-09-17 Wed 13:51]

Org Mode : Organizational tool in Emacs for note-taking, TODO lists, project planning, and authoring documents in a plain-text format. This largely sets up some defaults including =org-agenda= and =org-capture=

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Org Mode Configuration

  (use-package org
    :pin "orgmode"
    :mode ("\\.org\\'" . org-mode)
    :defer t
    :bind (("C-c a" . org-agenda)
  	 ("C-c c" . org-capture)
  	;("C-c j" . org-journal)
  	 (:map org-mode-map
  	       (("M-p" . outline-previous-visible-heading)
  		("M-n" . outline-next-visible-heading)
  		("C-c C-p" . eaf-org-export-to-pdf-and-open)
  		("C-c ;" . nil))))

    :custom
    (org-return-follows-link t)
    (org-export-backends (quote (ascii html latex md odt)))
    (org-confirm-babel-evaluate 'nil)
    (org-deadline-warning-days 7)
    (org-agenda-window-setup 'other-window)
    (org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (dot . t)))
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-todo-keywords
     '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
       (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))

    :custom-face
    (org-agenda-current-time ((t (:foreground "spring green"))))

    :hook ((org-mode . (lambda ()
  		       (set-face-attribute 'org-level-1 nil :height 1.4)
  		       (set-face-attribute 'org-level-2 nil :height 1.3)
  		       (set-face-attribute 'org-level-3 nil :height 1.2)
  		       (set-face-attribute 'org-level-4 nil :height 1.1)
  		       (set-face-attribute 'org-level-5 nil :height 1.1))))

    :config
    (unless (version<= org-version "9.2")
      (require 'org-tempo))

    (when (or (file-directory-p "~/org/agenda") (file-directory-p "~/org/journal"))
      (setq org-agenda-files (list "~/org/agenda" "~/org/journal"))))

  (use-package org-journal
    :bind (("C-c j n" . org-journal-new-entry)
  	 ("C-c j t" . hpl/org-journal-today))

    :custom
    (org-journal-date-prefix "#+TITLE: ")
    (org-journal-file-format "%Y-%m-%d.org")
    (org-journal-dir "~/org/journal")
    (org-journal-date-format "%Y-%m-%d")

    :config
    (defun hpl/org-journal-today ()
      (interactive)
      (org-journal-new-entry t)))

#+END_SRC

**** Java

To support Java, we'll use [[https://github.com/emacs-lsp/lsp-java][lsp-java]] as an LSP client with [[https://projects.eclipse.org/projects.eclipse.jdt.ls][Eclipse JDT Language Server]] as
LSP server. To use it, do not forget to configure the LSP package to to install this LSP
Server through LSP mode or with a system package manager. If the LSP server is not yet
installed, LSP will install it in the =~/.emacs.d/.cache/lsp/eclipse.jdt.ls= directory.
This can be altered with =lsp-java-server-install-dir=.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package lsp-java
    :hook (java-mode . lsp-deferred))
  
#+END_SRC

**** TODO nxml

To manage XML files, we use =nxml-mode= package built in to Emacs with LemMinX LSP server.
To use it, we need to ensure the LSP mode is installed.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- XML

  (use-package nxml-mode
    :straight nil ;; builtin
    :hook (nxml-mode . lsp-deferred)
    :mode ("\\.\\(xml\\|xsd\\|wsdl\\)\\'")
    )

#+END_SRC

**** TODO html

**** TODO css

**** TODO python

**** TODO sql

**** TODO toml

**** TODO yaml

**** TODO docker

To support Dockerfiles with LSP, the package =dockerfile-mode= with dockerfile-language-server-nodejs
(=dockerfile-ls=) is enough. To use it, do not forget to configure the LSP package and to  install this
LSP server through LSP-mode or with a system package manager.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package dockerfile-mode
    :mode "Dockerfile\\'")
  
#+END_SRC

**** TODO terraform

**** TODO nginx

**** ini Files

INI files are ubiquitous.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package ini-mode
    :mode "\\.ini\\'")
  
#+END_SRC

*** Lisps

**** Parentheses

***** Rainbow Parens

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (show-paren-mode 1)

  (use-package rainbow-delimiters
    :straight t

    :hook
    ((prog-mode . rainbow-delimiters-mode))

    :config
    ;; set colors to travel through the visual spectrum from red to blue
    '(rainbow-delimiters-depth-1-face ((t (:foreground "light slate blue"))))
    '(rainbow-delimiters-depth-2-face ((t (:foreground "cyan"))))
    '(rainbow-delimiters-depth-3-face ((t (:foreground "lime green"))))
    '(rainbow-delimiters-depth-4-face ((t (:foreground "yellow green"))))
    '(rainbow-delimiters-depth-5-face ((t (:foreground "yellow"))))
    '(rainbow-delimiters-depth-6-face ((t (:foreground "goldenrod"))))
    '(rainbow-delimiters-depth-7-face ((t (:foreground "dark orange"))))
    '(rainbow-delimiters-depth-8-face ((t (:foreground "orange red"))))
    '(rainbow-delimiters-depth-9-face ((t (:foreground "red2")))))

#+END_SRC

***** Color Strings

TODO move this somewhere else.

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package rainbow-mode
    :straight t
    :diminish rainbow-mode "🌈"
    :hook
    ((prog-mode . rainbow-mode)))


#+END_SRC

***** paredit

Paredit mode essentially orces you to edit on sexps, rather than text. It's hard to describe, and is kind of hard to use.

- https://github.com/mpenet/emax/blob/9c7a37f/init.el#L415

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Paredit mode

  (use-package paredit
    :ensure t
    :diminish (paredit-mode))
  ;;  :hook ((lisp-mode             . paredit-mode)
  ;;  (cider-mode            . paredit-mode)
  ;;  (cider-repl-mode       . paredit-mode)
  ;;     (clojure-mode          . paredit-mode)
  ;;  (emacs-lisp-mode       . paredit-mode))


#+END_SRC

**** lisp


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
    ;;; --- Emacs lisp settings, and common config for other lisps

  (defun hplogsdon/eval-last-sexp-or-region (prefix)
    "Eval region from BEG to END if active, otherwise the last sexp."
    (interactive "P")
    (if (and (mark) (use-region-p))
        (eval-region (min (point) (mark)) (max (point) (mark)))
      (pp-eval-last-sexp prefix)))

  ;; TODO: look into `litable' as an alternative
  (defun hplogsdon/elisp-eval-and-comment-output ()
    "Add the output of the sexp as a comment after the sexp"
    (interactive)
    (save-excursion
      (end-of-line)
      (condition-case nil
  	(printc (concat " ; -> " (pp-to-string (eval (preceding-sexp))))
  		(current-buffer))
        (error (message "Invalid expression")))))

  (defun hplogsdon/elisp-eval-region ()
    (interactive)
    (if (region-active-p)
        (progn
  	(eval-region (region-beginning)
  		     (region-end))
  	(deactivate-mark))
      (eval-expression)))

  (defun hplogsdon/elisp-headerize ()
    "Adds a header and footer to an elisp buffer for Flycheck"
    (interactive)
    (let ((fname (if (buffer-file-name)
  		   (file-name-nondirectory (buffer-file-name))
  		 (error "This buffer is not visiting a file"))))
      (save-excursion
        (goto-char (point-min))
        (insert ";;; " fname " --- Description -*- lexical-binding: t -*-\n"
  	      ";;; Commentary:\n"
  	      ";;; Code:\n\n")
        (goto-char (point-max))
        (insert ";;; " fname " ends here\n"))))

  (defun hplogsdon/elisp-register-elc-delete-on-save ()
    "If you're saving an elisp file, the .elc is likely invalid."
    (make-local-variable 'after-save-hook)
    (add-hook 'after-save-hook
  	    '(lambda ()
  	       (when (file-exists-p (concat buffer-file-name "c"))
  		 (delete-file (concat buffer-file-name "c"))))))

  (use-package emacs-lisp-mode
    :defer t
    :hook ((emacs-lisp-mode . outline-minor-mode)
  	 (emacs-lisp-mode . reveal-mode)
  	 (emacs-lisp-mode . eldoc-mode))
    :bind (("C-x e" . hplogsdon/elisp-eval-and-comment-output))
    :mode (("\\.el$" . emacs-lisp-mode))
    :init
    (setq initial-major-mode 'emacs-lisp-mode)
    (hplogsdon/elisp-register-elc-delete-on-save)

    :config
    (eldoc-mode 1)
    (hplogsdon/elisp-register-elc-delete-on-save))


  (use-package color-identifiers-mode
    :ensure t
    :hook ((emacs-lisp-mode . color-identifiers-mode)))


#+END_SRC

**** TODO clojure


***** Clojure Mode

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Clojure lanaguage
  (use-package clojure-mode
    :mode (("\\.boot$"  . clojure-mode)
  	 ("\\.clj$"   . clojure-mode)
  	 ("\\.cljc$"  . clojure-mode)
  	 ("\\.cljs$"  . clojurescript-mode)
  	 ("\\.edn$"   . clojure-mode)
  	 ("lein-env$" . clojure-mode)
    :config
    (use-package align-cljlet
      :bind (:map clojure-mode-map
  		("C-! a a" . align-cljlet)
  		:map clojurescript-mode-map
  		("C-! a a" . align-cljlet)
  		:map clojurec-mode-map
  		("C-! a a" . align-cljlet))))

#+END_SRC

***** Clojure Refactor


#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  (use-package clj-refactor
    :disabled
    :init
    (defun hpl/clj-refactor-mode-hook ()
      ;;(yas-minor-mode 1)
      (clj-refactor-mode 1))
    (add-hook 'clojure-mode-hook #'hpl/clj-refactor-mode-hook)
    (setq cljr-clojure-test-declaration "[clojure.test :refer :all]"
  	cljr-cljs-clojure-test-declaration "[cljs.test :refer-macros [deftest is use-fixtures]]")
    :config
    (cljr-add-keybindings-with-prefix "<menu>")
    (add-to-list 'cljr-magic-require-namespaces
  	       '("s" . "clojure.spec.alpha")))

#+END_SRC

