init.el

;; [[file:../Emacs.org::*orgmode][orgmode:1]]
;;; --- Org Mode Configuration

(use-package org
  :pin "orgmode"
  :mode ("\\.org\\'" . org-mode)
  :defer t
  :bind (("C-c a" . org-agenda)
		 ("C-c c" . org-capture)
		 ;("C-c j" . org-journal)
		 (:map org-mode-map
			   (("M-p" . outline-previous-visible-heading)
				("M-n" . outline-next-visible-heading)
				("C-c C-p" . eaf-org-export-to-pdf-and-open)
				("C-c ;" . nil))))

  :custom
  (org-return-follows-link t)
  (org-export-backends (quote (ascii html latex md odt)))
  (org-confirm-babel-evaluate 'nil)
  (org-deadline-warning-days 7)
  (org-agenda-window-setup 'other-window)
  (org-babel-load-languages
   '((emacs-lisp . t)
	 (python . t)
	 (dot . t)))
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-todo-keywords
   '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
	 (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))

  :custom-face
  (org-agenda-current-time ((t (:foreground "spring green"))))

  :config
  (unless (version< org-version "9.2")
	(require 'org-tempo))
  (when (or (file-directory-p "~/org/agenda") (file-directory-p "~/org/journal"))
    (setq org-agenda-files (list "~/org/agenda" "~/org/journal"))))

(use-package org-journal
  :bind (("C-c j n" . org-journal-new-entry)
	   ("C-c j t" . org-journal-today))

  :custom
  (org-journal-date-prefix "#+TITLE: ")
  (org-journal-file-format "%Y-%m-%d.org")
  (org-journal-dir "~/org/journal")
  (org-journal-date-format "%Y-%m-%d")

  :config
  (defun org-journal-today ()
	(interactive)
	(org-journal-new-entry t)))
;; orgmode:1 ends here

;;; --- Paredit mode

(use-package paredit
  :ensure t
  :diminish (paredit-mode))
;;  :hook ((lisp-mode             . paredit-mode)
;;	 (cider-mode            . paredit-mode)
;;	 (cider-repl-mode       . paredit-mode)
;;     (clojure-mode          . paredit-mode)
;;	 (emacs-lisp-mode       . paredit-mode))

;;; --- Emacs lisp settings, and common config for other lisps

(defun hplogsdon/eval-last-sexp-or-region (prefix)
  "Eval region from BEG to END if active, otherwise the last sexp."
  (interactive "P")
  (if (and (mark) (use-region-p))
	  (eval-region (min (point) (mark)) (max (point) (mark)))
	(pp-eval-last-sexp prefix)))

;; TODO: look into `litable' as an alternative
(defun hplogsdon/elisp-eval-and-comment-output ()
  "Add the output of the sexp as a comment after the sexp"
  (interactive)
  (save-excursion
	(end-of-line)
	(condition-case nil
		(printc (concat " ; -> " (pp-to-string (eval (preceding-sexp))))
				(current-buffer))
	  (error (message "Invalid expression")))))

(defun hplogsdon/elisp-eval-region ()
  (interactive)
  (if (region-active-p)
	  (progn
		(eval-region (region-beginning)
					 (region-end))
		(deactivate-mark))
	(eval-expression)))

(defun hplogsdon/elisp-headerize ()
  "Adds a header and footer to an elisp buffer for Flycheck"
  (interactive)
  (let ((fname (if (buffer-file-name)
				   (file-name-nondirectory (buffer-file-name))
				 (error "This buffer is not visiting a file"))))
	(save-excursion
	  (goto-char (point-min))
	  (insert ";;; " fname " --- Description -*- lexical-binding: t -*-\n"
			  ";;; Commentary:\n"
			  ";;; Code:\n\n")
	  (goto-char (point-max))
	  (insert ";;; " fname " ends here\n"))))

(defun hplogsdon/elisp-register-elc-delete-on-save ()
  "If you're saving an elisp file, the .elc is likely invalid."
  (make-local-variable 'after-save-hook)
  (add-hook 'after-save-hook
			'(lambda ()
			   (when (file-exists-p (concat buffer-file-name "c"))
				 (delete-file (concat buffer-file-name "c"))))))

(use-package emacs-lisp-mode
  :defer t
  :hook ((emacs-lisp-mode . outline-minor-mode)
	       (emacs-lisp-mode . reveal-mode)
         (emacs-lisp-mode . eldoc-mode))
  :bind (("C-x e" . hplogsdon/elisp-eval-and-comment-output))
  :mode (("\\.el$" . emacs-lisp-mode))
  :init
  (setq initial-major-mode 'emacs-lisp-mode)
  (hplogsdon/elisp-register-elc-delete-on-save)

  :config
  (eldoc-mode 1)
  (hplogsdon/elisp-register-elc-delete-on-save))


(use-package color-identifiers-mode
  :ensure t
  :hook ((emacs-lisp-mode . color-identifiers-mode)))

;; [[file:../Emacs.org::*which-key][which-key:1]]
;;; --- Which Key
