README.org
***** CIDER

#+begin_src emacs-lisp :tangle init.el :comments link
  (use-package cider
    :bind (:map cider-repl-mode-map
  	 ("M-r" . cider-refresh)
  	 ("C-c r" . cider-repl-reset)
  	 ("M-R" . hpl/cider-user-repl-tools)
  	 :map clojure-mode-map
  	 ("C-M-r" . hpl/cider-refresh)
  	 ("C-c C-v" . hpl/cider-start-http-server)
  	 ("C-c u" . hpl/cider-user-ns)
  	 :map cider-mode-map
  	 ("C-c u" . hpl/cider-user-ns))
    
    :hook
    (;; Enable paredit in the cider REPL
     ;;(cider-mode . paredit-mode)
     ;; Provides minibuffer docs when writing to the REPL
     (cider-mode . cider-turn-on-eldoc-mode))  
    
    :config
    (setq nrepl-hide-special-buffers t
  	nrepl-popup-stacktraces-in-repl t
  	nrepl-history-file "~/.emacs.d/nrepl-history"

  	cider-mode-line " CIDER"
  	cider-repl-display-in-current-window t
  	;; Where to store cider history
  	cider-repl-history-file "~/.emacs.d/.cider-repl-history"
  	;; Go right to the REPL when it connects
  	cider-repl-pop-to-buffer-on-connect t
  	;; When there is a cider error, show its buffer and switch to it
  	cider-show-error-buffer nil
  	cider-auto-select-error-buffer nil
  	;; wrap when navigating history
  	cider-repl-wrap-history t
  	
  	cider-repl-use-pretty-printing t
  	cider-cljs-lein-repl "(do (use 'figwheel-sidecar.repl-api) (start-figwheel!) (cljs-repl))")

    (defun hpl/cider-use-repl-tools ()
      (interactive)
      (cider-interactive-repl
       "(use 'clojure.repl)"))

    (defun hpl/cider-start-http-server ()
      (interactive)
      (cider-load-current-buffer)
      (let ((ns (cider-current-ns)))
        (cider-repl-set-ns ns)
        (cider-interactive-eval (format "(println '(def server (%s/start))) (println 'server)" ns))
        (cider-interactive-eval (format "(def server (%s/start)) (println server)" ns))))

    (defun hpl/cider-refresh ()
      (interactive)
      (cider-interactive-eval "(user/reset)"))

    (defun hpl/cider-user-ns ()
      (interactive)
      (cider-repl-set-ns "user"))        

    (fset 'cider-eval-last-sexp-and-comment
  	"\C-u\C-x\C-e\C-a\260 ;; \C-e")

    (bind-key "C-j" 'cider-eval-last-sexp-and-comment clojure-mode-map)

    ;; this snippet comes from schmir https://github.com/schmir/.emacs.d/blob/master/lisp/setup-clojure.el
    (advice-add 'cider-load-buffer :after
  	      (lambda (&rest _)
  		"Switch to namespace"
  		(cider-repl-set-ns (cider-current-ns))
  		(cider-switch-to-repl-buffer)))

    ;; Fix cond indenting
    (put 'cond 'clojure-backtracking-indent '(2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4 2 4)))

#+end_src


*** Extra Enhancements

**** Ergonomics

Silly things that I find make a more enjoyable experience

***** which-key

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;;; --- Which Key

  (use-package which-key
    :ensure t
    :diminish ""
    :custom
    (which-key-mode t))

  (use-package which-key-posframe
    :config
    (set-face-attribute 'which-key-posframe nil :background "wheat1")
    :custom
    (which-key-posframe-mode t)
    (which-key-posframe-poshandler 'posframe-poshandler-frame-bottom-left-corner))

  (which-function-mode t)

#+END_SRC


**** TODO spellcheck

**** TODO terminals

Terminal Emulators in Emacs

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;; --- Terminals in Emacs
  
  ;;(use-package vterm
  ;;  :ensure t)

  ;;(use-package eat
  ;;  :ensure t)

#+END_SRC

**** TODO Claude code

Guess we can do this here. Might as well try it

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;; --- Anthropic Claude Code

  (use-package claude-code
    :ensure t
    :after (:any eat vterm)
    :straight
    (claude-code :type git :host github :repo "stevemolitor/claude-code.el")

    :config
    (claude-code-mode)
    ;; eat is the default, but we could change to vterm
    ;;(setq claude-code-terminal-backend 'vterm)
    ;;(setq claude-code-terminal-backend 'eat)

    :bind-keymap
    ("C-c C" . claude-code-command-mode))

#+END_SRC


** Extra Packages


*** TODO sudo

*** TODO osx-location

*** TODO dotenv

*** TODO shfmt

*** TODO uptimes

*** TODO eldoc

*** TODO direnv

*** TODO treesitter


** Footer

Finally, set a few final items and close out the file

#+BEGIN_SRC emacs-lisp :tangle init.el :comments link
  ;; Allow access from emacsclient
  (add-hook 'after-init-hook
  	  (lambda ()
  	    (require 'server)
  	    (unless (server-running-p)
  	      (server-start))))

  (when (file-exists-p custom-file)
    (load custom-file))


   ;;; Configure default locales
  (defun sanityinc/locale-var-encoding (v)
    "Returning the encoding portion of the locale string V, or nil if missing."
    (when v
      (save-match-data)
      (let ((case-fold-search t))
        (when (string-match "\\.\\([^.]*\\)\\'" v)
          (intern (downcase (match-string 1 v)))))))

  (dolist (varname '("LC_ALL" "LANG" "LC_CTYPE"))
    (let ((encoding (sanityinc/locale-var-encoding (getenv varname))))
      (unless (memq encoding '(nil utf8 utf-8))
        (message "Warning: non-UTF8 encoding in environment variable %s may cause interop problems with this Emacs configuration." varname))))

  ;; Set UTF-8 as the default encoding
  (when (fboundp 'set-charset-priority)
    (set-charset-priority 'unicode))
  (prefer-coding-system 'utf-8-unix)
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (unless *is-windows*
    (set-selection-coding-system 'utf-8))


  ;;; init.el ends here
#+END_SRC

Finally end out the file

#+BEGIN_SRC emacs-lisp :tangle init.el :comments no
  ;; Local Variables:
  ;; coding: utf-8-unix
  ;; no-byte-compile: t
  ;; End:
  (provide 'init)
#+END_SRC
