init.el

(use-package which-key
  :ensure t
  :diminish ""
  :custom
  (which-key-mode t))

(use-package which-key-posframe
  :config
  (set-face-attribute 'which-key-posframe nil :background "wheat1")
  :custom
  (which-key-posframe-mode t)
  (which-key-posframe-poshandler 'posframe-poshandler-frame-bottom-left-corner))

(which-function-mode t)
;; which-key:1 ends here

;; [[file:../Emacs.org::*Footer][Footer:1]]
;; Allow access from emacsclient 
(add-hook 'after-init-hook
          (lambda ()
            (require 'server)
            (unless (server-running-p)
              (server-start))))

(when (file-exists-p custom-file)
	(load custom-file))


;;; Configure default locales
(defun sanityinc/locale-var-encoding (v)
  "Returning the encoding portion of the locale string V, or nil if missing."
  (when v
    (save-match-data)
      (let ((case-fold-search t))
        (when (string-match "\\.\\([^.]*\\)\\'" v)
          (intern (downcase (match-string 1 v)))))))

(dolist (varname '("LC_ALL" "LANG" "LC_CTYPE"))
  (let ((encoding (sanityinc/locale-var-encoding (getenv varname))))
    (unless (memq encoding '(nil utf8 utf-8))
      (message "Warning: non-UTF8 encoding in environment variable %s may cause interop problems with this Emacs configuration." varname))))

;; Set UTF-8 as the default encoding
(when (fboundp 'set-charset-priority)
  (set-charset-priority 'unicode))       
(prefer-coding-system 'utf-8-unix)
(setq locale-coding-system 'utf-8
      coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8)
(unless *is-windows*
  (set-selection-coding-system 'utf-8))


(provide 'init)
;; Local Variables:
;; coding: utf-8-unix
;; no-byte-compile: t
;; End:
;;; init.el ends here
;; Footer:1 ends here
